       IDENTIFICATION DIVISION.
       PROGRAM-ID. FOLHA.
       AUTHOR.     ALEX MARTINS.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT FUNCIONARIO ASSIGN TO "ENTRADA.DAT"
       ORGANIZATION IS LINE SEQUENTIAL.
       SELECT PRINT-FILE ASSIGN TO "SAIDA.DAT".

       DATA DIVISION.
       FILE SECTION.
       FD FUNCIONARIO.

       01 SALESDETAILS.
           88 ENDOFSALES VALUE HIGH-VALUES.
           05 MESREF       PIC 9(5).
           05 DESCRICAO            PIC X(40).
           05 PROVENTOS            PIC 99999V99 .
           05 FILLER              PIC X(5) VALUE SPACES.
           05 DESCONTOS            PIC 99999V99.

        FD PRINT-FILE.
       01 PRINT-LINE              PIC X(132).

       WORKING-STORAGE SECTION.

       01 TITULO-LINE.
           05 FILLER              PIC X(25) VALUE SPACES.
           05 FILLER PIC X(32) VALUE 'RECIBO DE PAGAMENTO DE SALÁRIO'.
           

       01 HEADING-LINE.
           05 FILLER              PIC X(5) VALUE SPACES.
           05 FILLER              PIC X(16) VALUE 'DESCRIÇÃO'.
           05 FILLER              PIC X(21) VALUE SPACES.
           05 FILLER              PIC X(13)  VALUE 'PROVENTOS(R$)'.
           05 FILLER              PIC X(6) VALUE SPACES.
           05 FILLER              PIC X(13) VALUE 'DESCONTOS(R$)'.
           05 FILLER              PIC X(73) VALUE SPACES.

       01 DETAIL-LINE.
            05 FILLER               PIC X(5)  VALUE SPACES.
            05 DET-DESCRICAO        PIC X(33).
            05 FILLER               PIC X(4)  VALUE SPACES.
            05 DET-PROVENTOS        PIC ZZZZZ.ZZ.
            05 FILLER               PIC X(9)  VALUE SPACES.
            05 DET-DESCONTOS        PIC ZZZZZ.ZZ.
            05 FILLER               PIC X(40)  VALUE SPACES.

       01 SALDO-LINE.
            05 FILLER               PIC X(5)  VALUE SPACES.
            05 FILLER               PIC X(8) VALUE 'SALDO R$'.
            05 DET-SALDO            PIC ZZZZZZ.ZZ.
            05 FILLER               PIC X(5)  VALUE SPACES.
            

       01 WS-TOTAL-PROVENTOS        PIC 9999999V99 VALUE ZERO.
       01 WS-TOTAL-DESCONTOS        PIC 9999999V99 VALUE ZERO.
       01 WS-SALDO                  PIC 9999999V99 VALUE ZERO.
       01 WS-MESREF                 PIC 9(5).

        PROCEDURE DIVISION.
       0050-OPEN-FILE.
           OPEN INPUT FUNCIONARIO
           OPEN OUTPUT PRINT-FILE
           PERFORM 0100-PROCESS-RECORDS
           PERFORM 0105-WRITE-BLANK-LINE
           PERFORM 0130-CALCULATE-TOTAL
           PERFORM 0150-WRITE-SALDO-LINE.
           PERFORM 0200-STOP-RUN.

       0100-PROCESS-RECORDS.
           PERFORM 0107-WRITE-TITULO-LINE.
           PERFORM 0110-WRITE-HEADING-LINE.
           READ FUNCIONARIO
            AT END SET ENDOFSALES TO TRUE
           END-READ.
           PERFORM UNTIL ENDOFSALES         
            MOVE DESCRICAO TO DET-DESCRICAO
            MOVE PROVENTOS TO DET-PROVENTOS
            INSPECT DET-PROVENTOS REPLACING ALL '.' BY ','
            MOVE DESCONTOS  TO DET-DESCONTOS
            INSPECT DET-DESCONTOS REPLACING ALL '.' BY ','
            ADD PROVENTOS TO WS-TOTAL-PROVENTOS
            ADD DESCONTOS TO WS-TOTAL-DESCONTOS
            ADD PROVENTOS TO WS-SALDO
            SUBTRACT DESCONTOS FROM WS-SALDO
            MOVE DETAIL-LINE TO PRINT-LINE
           WRITE PRINT-LINE AFTER ADVANCING 1 LINE
            READ FUNCIONARIO
                AT END SET ENDOFSALES TO TRUE
            END-READ
           END-PERFORM.

       0105-WRITE-BLANK-LINE.    
           MOVE SPACES TO DET-DESCRICAO
           MOVE ZEROS TO DET-PROVENTOS
           MOVE ZEROS TO DET-DESCONTOS
           MOVE DETAIL-LINE TO PRINT-LINE
           WRITE PRINT-LINE AFTER ADVANCING 1 LINE.

       0107-WRITE-TITULO-LINE.
           MOVE TITULO-LINE TO PRINT-LINE
           WRITE PRINT-LINE
           PERFORM 0105-WRITE-BLANK-LINE.
           

       0110-WRITE-HEADING-LINE.
           MOVE HEADING-LINE TO PRINT-LINE
           WRITE PRINT-LINE AFTER ADVANCING 1 LINE
           MOVE SPACES TO PRINT-LINE
           WRITE PRINT-LINE.

       0130-CALCULATE-TOTAL.
           MOVE WS-TOTAL-PROVENTOS TO DET-PROVENTOS
           MOVE WS-TOTAL-DESCONTOS TO DET-DESCONTOS
           INSPECT DET-PROVENTOS REPLACING ALL '.' BY ','
           INSPECT DET-DESCONTOS REPLACING ALL '.' BY ','    
           MOVE 'TOTAL' TO DET-DESCRICAO
           MOVE DETAIL-LINE TO PRINT-LINE
           WRITE PRINT-LINE AFTER ADVANCING 1 LINE.

       

       0150-WRITE-SALDO-LINE.
           
           MOVE WS-SALDO TO DET-SALDO
           INSPECT DET-SALDO REPLACING ALL '.' BY ','
           MOVE SALDO-LINE TO PRINT-LINE
           WRITE PRINT-LINE AFTER ADVANCING 1 LINE.

       0200-STOP-RUN.
            CLOSE FUNCIONARIO
            CLOSE PRINT-FILE
            STOP RUN.

       END PROGRAM FOLHA.
      